Revit 2024 API
BuildingEnvelopeAnalyzerOptions Class
 Specific options for the method analyzing the building elements for the building envelope.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class BuildingEnvelopeAnalyzerOptions : IDisposable
Visual Basic
Public Class BuildingEnvelopeAnalyzerOptions _
	Implements IDisposable
Visual C++
public ref class BuildingEnvelopeAnalyzerOptions : IDisposable
Remarks
 The analyze method uses a combination of ray-casting and flood-fill algorithms in order to find the building elements that are exposed to the outside of the building. The analyze method can also look for the bounding building elements for enclosed space volumes inside the building.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzerOptions
See Also
BuildingEnvelopeAnalyzerOptions Members
Autodesk.Revit.DB.Analysis Namespace